MES구축Cell 일일보고(2022-01-03, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사예산서등록(CBEVRS00070) 수정 개발 (2022-01-03, 80%)
         - 주요 일정 (12/23 ~ )
           [진행중] 고객 요구 분석 (90%)
           [진행중] 개발 (Front-End / Back-End) (80%)
         - 행사예산서 출력 양식에 대한 문의가 해결되지 않아,
           출력기능은 개발 대기중
    2) 행사결산서등록(CBEVAC00010) 수정 개발 (2022-01-05, 0%)
         - 주요 일정 (01/03 ~ )
           [예정] 고객 요구 분석 (0%)
           [예정] 개발 (Front-End / Back-End) (0%)

           

MES구축Cell 일일보고(2022-01-04, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사예산서등록(CBEVRS00070) 수정 개발 (2022-01-03, 85%)
         - 주요 일정 (12/23 ~ )
           [진행중] 고객 요구 분석 (20%)
           [진행중] 개발 (Front-End / Back-End) (20%)
         - 행사예산서 출력 양식에 대한 문의가 해결되지 않아,
           출력기능은 개발 대기중
    2) 행사결산서등록(CBEVAC00010) 수정 개발 (2022-01-05, 50%)
         - 주요 일정 (01/03 ~ )
           [예정] 고객 요구 분석 (60%)
           [예정] 개발 (Front-End / Back-End) (50%)


           
MES구축Cell 일일보고(2022-01-05, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사예산서등록(CBEVRS00070) 수정 개발 (2022-01-03, 85%)
         - 주요 일정 (12/23 ~ )
           [진행중] 고객 요구 분석 (90%)
           [진행중] 개발 (Front-End / Back-End) (80%)
         - 행사예산서 출력 양식에 대한 문의가 해결되지 않아,
           출력기능은 개발 대기중
    2) 행사결산서등록(CBEVAC00010) 수정 개발 (2022-01-05, 75%)
         - 주요 일정 (01/03 ~ )
           [진행중] 고객 요구 분석 (90%)
           [진행중] 개발 (Front-End / Back-End) (90%)
         - 설계 일부 변경으로 인한 개발 지연
             > dtlGrid에 대한 구성 변경 (사용 공통코드 변경 등)
    3) 센터확장비확인_일괄업로드 (NPRDQR00350) 수정 요청 반영 (2022-01-05, 100%)
         - 담당 PM(윤오성 수석연구원)의 요청으로 인한 조회 로직 수정

         
         
MES구축Cell 일일보고(2022-01-06, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사예산서등록(CBEVRS00070) 수정 개발 (2022-01-03, 85%)
         - 주요 일정 (12/23 ~ )
           [진행중] 고객 요구 분석 (90%)
           [진행중] 개발 (Front-End / Back-End) (80%)
         - 행사예산서 출력 양식에 대한 문의가 해결되지 않아,
           출력기능은 개발 대기중
    2) 행사결산서등록(CBEVAC00010) 수정 개발 (2022-01-06, 100%)
         - 주요 일정 (01/03 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
         - 설계 일부 변경으로 인한 개발 지연
             > dtlGrid에 대한 구성 변경 (사용 공통코드 변경 등)
    3) 매출조정(NPSLQR00330) 부서 드랍다운리스트 수정 요청 반영 (개선) (2022-01-06, 100%)
	     - 개요
		   담당 설계자(하옥주 부장)의 요청에 따른 수정 요청 반영
	     - 주요 일정 (01/06 ~ )
		   [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
    4) 년간확장부수및수수료 조회(NPRDQR00130) 단위테스트에 따른 수정 요청 반영 (2022-01-06, 100%)
	     - 주요 일정 (01/06 ~ )
		   [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)



MES구축Cell 일일보고(2022-01-07, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사예산서등록(CBEVRS00070) 수정 개발 (2022-01-07, 100%)
         - 주요 일정 (12/23 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
         - 행사예산서 출력 양식에 대한 문의가 해결되지 않아, 인수인계 후 완료처리
	2) 지원비결재(NPSLQR00320) 단위테스트에 따른 수정 요청 반영 (2022-01-07, 100%)
         - 주요 일정 (01/07 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
    3) 미납센터 추가매출(NPSLQR00310) 단위테스트에 따른 수정 요청 반영 (2022-01-07, 100%)
         - 주요 일정 (01/07 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
    4) 보증금입출현황(NPSLQR00860) 단위테스트에 따른 수정 요청 반영 (2022-01-07, 100%)
         - 주요 일정 (01/07 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)

           

MES구축Cell 일일보고(2022-01-10, 류상현)
   [MES10 개발]
    1) MES10 개발을 위한 개발환경 재구성 (2022-01-10, 100%)
         - Src 동기화 / Web Config 변경 등
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    2) 행사관리 단위테스트에 따른 수정개발의 건 (2022-01-10, 100%)
         - 대상 화면 (총 2건)
           행사사용자관리(CBEVMA00010)
           행사구분관리(CBEVMA00020)
         - 주요 일정 (01/10 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
    3) 신문판매(NP) 단위테스트에 따른 수정개발의 건 (NPEXQR00260) (2022-01-10, 100%)
         - 주요 일정 (01/10 ~ )
           [완료] 고객 요구 분석 (100%)
           [완료] 개발 (Front-End / Back-End) (100%)
         - 설계 단계에서의 수정이 필요하여, 해당 부분에 대해서는 담당자에게 통보 완료

         

MES구축Cell 일일보고(2022-01-11, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사관리 모듈 인수인계 미팅
         - 일시 : 2022-01-12 14:00
         - 장소 : 동아일보 충정로 사옥
         - 참석 인원 : 구영미 부장, 김대영A 과장, 류상현 주임연구원
         - 주요 논의 사항
            > 대상 메뉴 10건에 대한 Code 리뷰
            > 메뉴 개발 중 발생한 특이사항 인수인계
   [MES10 개발]
    1) 기존 MES10 개발 로직 분석
         - 기존 MES10 개발환경 재구성 및 로직 분석
    2) 더마펌_모니터링 - 공정운영관리 메뉴 점검
         - 대상 메뉴 : 총 5건
         - 해당 DB에 대한 방화벽 설정이 되어있지 않아, 상신.
            방화벽 적용 후 점검 예정

            

MES구축Cell 일일보고(2022-01-12, 류상현)
   [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사관리(CB) 단위 테스트(1차) 관련 수정 요청 반영 (2022-01-12, 100%)
         - 대상 메뉴 : 총 2건
         - 주요 일정 (2022-01-12 ~)
            [완료] 고객 요구 분석 (100%)
            [완료] 개발 (Front-End / Back-End) (100%)
   [MES10 개발]
    1) 기존 MES10 개발 로직 분석
         - 기존 MES10 개발환경 재구성 및 로직 분석
    2) 더마펌_모니터링 - 공정운영관리 메뉴 점검
         - 대상 메뉴 : 총 5건
         - 방화벽 적용 완료되었으며, 해당 확인 후 메뉴 점검 예정



MES구축Cell 일일보고(2022-01-13, 류상현)
	[MES10 개발]
	1) 기존 MES10 개발 로직 분석
	     - 기존 MES10 개발환경 재구성 및 로직 분석
	2) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-15, 30%)
	     - 대상 메뉴 : 총 5건
		 - 주요 일정 (2022-01-13 ~)
            [진행중] 기존 로직 분석 (30%)
			[진행중] 페이지 기능 점검 및 특이사항 리스트업 (40%)
            [예정] 수정 개발 (Front-End / Back-End) (0%)

            

MES구축Cell 일일보고(2022-01-14, 류상현)
    [MES10 개발]
     1) 더마펌_모니터링
          - 공정운영관리 메뉴 점검 (2022-01-19, 30%)
          - 대상 메뉴 : 총 2건
          - 주요 일정 (2022-01-14 ~)
             [진행중] 기존 로직 분석 (30%)
             [진행중] 페이지 기능 점검 및 특이사항 리스트업 (40%)
             [예정] 수정 개발 (Front-End / Back-End) (0%)
          - 대상 메뉴가 설비 관련 메뉴로 변경됨



MES구축Cell 일일보고(2022-01-18, 류상현)
    [MES10 개발]
    1) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-21, 30%)
         - 대상 메뉴 : 총 2건
             > 설비가동현황 MNTPOM00200
                설비가동률현황 MNTPOM00400
         - 주요 일정 (2022-01-18 ~)
            [진행중] 기존 로직 분석 (30%)
            [진행중] 페이지 기능 점검 및 특이사항 리스트업 (40%)
            [예정] 수정 개발 (Front-End / Back-End) (0%)



MES구축Cell 일일보고(2022-01-19, 류상현)
    [MES10 개발]
    1) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-21, 80%)
         - 대상 메뉴 : 총 2건
             > 설비가동현황 MNTPOM00200
                설비가동률현황 MNTPOM00400
         - 주요 일정 (2022-01-18 ~)
            [진행중] 기존 로직 분석 (90%)
            [진행중] 페이지 기능 점검 및 특이사항 리스트업 (80%)
            [예정] 수정 개발 (Front-End / Back-End) (0%)
    [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사관리(CB) 모듈 2차 단위테스트에 따른 수정 개발 (2022-01-20, 90%)
         - 2차 모듈 테스트에 따른 수정개발 요청 (김대영A 과장)
         - 주요 일정 (2022-01-19 ~)
            [완료] 요구사항 분석
            [예정] 수정 개발 및 테스트 (Front-End / Back-End) (90%)
         - 개발 및 배포 완료, 테스트 예정 (2022-01-20 오전)

         

MES구축Cell 일일보고(2022-01-20, 류상현)
    [MES10 개발]
    1) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-21, 90%)
         - 대상 메뉴 : 총 2건
            > 설비가동현황 MNTPOM00200
               설비가동률현황 MNTPOM00400
         - 주요 일정 (2022-01-18 ~)
            [진행중] 기존 로직 분석 (90%)
            [진행중] 페이지 기능 점검 및 특이사항 리스트업 (80%)
            [예정] 수정 개발 (Front-End / Back-End) (0%)
    [동아일보 통합 ERP 시스템 구축 프로젝트]
    1) 행사관리(CB) 모듈 2차 단위테스트에 따른 수정 개발 (2022-01-20, 100%)
         - 2차 모듈 테스트에 따른 수정개발 요청 (김대영A 과장)
         - 주요 일정 (2022-01-19 ~)
            [완료] 요구사항 분석
            [완료] 수정 개발 및 테스트 (Front-End / Back-End)



MES구축Cell 일일보고(2022-01-20, 류상현)
    [MES10 개발]
    1) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-21, 90%)
        - 대상 메뉴 : 총 2건
    	> 설비가동현황 MNTPOM00200
    	   설비가동률현황 MNTPOM00400
        - 주요 일정 (2022-01-18 ~)
            [진행중] 기존 로직 분석 (90%)
    	[진행중] 페이지 기능 점검 및 특이사항 리스트업 (90%)
            [예정] 수정 개발 (Front-End / Back-End) (50%)
        - 현재 개발서버에 데이터 생성하여 테스트 진행중

        

MES구축Cell 일일보고(2022-01-24, 류상현)
    [MES10 개발]
    1) 더마펌_모니터링 - 공정운영관리 메뉴 점검 (2022-01-21, 100%)
         - 대상 메뉴 : 총 2건
            > 설비가동현황 MNTPOM00200
               설비가동률현황 MNTPOM00400
               설비가동분석 MNTFSM00100
         - 주요 일정 (2022-01-18 ~)
            [완료] 기존 로직 분석 (100%)
            [완료] 페이지 기능 점검 및 특이사항 리스트업 (100%)
            [완료] 수정 개발 (Front-End / Back-End) (100%)



MES구축Cell 일일보고(2022-01-26, 류상현)
    [MES10 개발]
    1) 더마펌_품질검사 - 출력물 양식 조정 (2022-01-27, 90%)
         - 대상 메뉴 : 총 2건
            > 공정검사요청 MQCISP00100
               검사현황조회 MQCISP00400
         - 주요 일정 (2022-01-26 ~)
            [완료] 기존 로직 분석 (100%)
            [완료] 페이지 기능 점검 및 특이사항 리스트업 (100%)
            [진행중] 수정 개발 (Front-End / Back-End) (90%)



MES구축Cell 일일보고(2022-01-26, 류상현)
    [MES10 개발]
    1) 더마펌_품질검사 - 출력물 양식 조정 (2022-01-27, 100%)
         - 대상 메뉴 : 총 2건
            > 공정검사요청 MQCISP00100
               검사현황조회 MQCISP00400
         - 주요 일정 (2022-01-26 ~)
            [완료] 기존 로직 분석 (100%)
            [완료] 페이지 기능 점검 및 특이사항 리스트업 (100%)
            [완료] 수정 개발 (Front-End / Back-End) (100%)
    2) 더마펌_작업실적현황출력물 양식 조정 (2022-01-28, 80%)
         - 대상 메뉴 : 총 1건
            > 칭량실적현황 WKMWKS00600
         - 주요 일정 (2022-01-27 ~)
            [완료] 기존 로직 분석 (100%)
            [진행중] 수정 개발 (Front-End / Back-End) (80%)



MES구축Cell 일일보고(2022-01-28, 류상현)
	[MES10 개발]
	1) 더마펌_칭량실적현황출력물 양식 조정 (2022-01-28, 100%)
         - 대상 메뉴 : 총 1건
            > 칭량실적현황 WKMWKS00600
         - 주요 일정 (2022-01-27 ~)
            [완료] 기존 로직 분석 (100%)
            [진행중] 수정 개발 (Front-End / Back-End) (100%)



MES구축Cell 일일보고(2022-02-03, 류상현)
    [MES10 개발]
    1) 더마펌_칭량실적현황출력물 양식 조정 (2022-02-03, 100%)
         - 대상 메뉴 : 총 1건
            > 칭량실적현황 WKMWKS00600
         - 주요 일정 (2022-01-27 ~)
            [완료] 기존 로직 분석 (100%)
            [진행중] 수정 개발 (Front-End / Back-End) (100%)
         - '칭량 지시자' / '칭량 지시일' 항목 추가 및 일부 양식 조정
    2) 더마펌_기존 로직 분석 (2022-02-03, 10%)
         - 주요 일정 (2022-02-03 ~)
            [진행중] 기존 프로젝트 로직 분석 (10%)
         - TIC 프로젝트를 진행하기 위한 선행 과정



MES구축Cell 일일보고(2022-02-04, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (공수 산정 예정, 40%)
        - 주요 일정 (2022-02-03 ~)
          [진행중] 기존 프로젝트 로직 분석 (40%)
        - TIC 프로젝트를 진행하기 위한 선행 과정
        - 생산지시 -> 실적 프로세스 정리 및 기능 분석

        

MES구축Cell 일일보고(2022-02-07, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (공수 산정 예정, 30%)
        - 주요 일정 (2022-02-03 ~)
          [진행중] 기존 프로젝트 로직 분석 (30%)
        - TIC 프로젝트를 진행하기 위한 선행 과정
        - 생산지시 -> 실적 프로세스 / 기준정보 / 



MES구축Cell 일일보고(2022-02-07, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (공수 산정 예정, 40%)
         - 더마펌 MES 페이지에서 기준정보 관련 프로세스 분석
         - 대상 화면 (총 8건)
            지역라인 등록 / 설비 등록
            작업장 등록 / 공정 등록
            작업조등록 / 작업캘린더등록
            비가동사유등록 / 공정별설비등록



MES구축Cell 일일보고(2022-02-10, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (50%)
         - 더마펌 MES 페이지에서 기준정보 관련 프로세스 분석
         - 대상 화면 (총 8건)
           품질정보 (품목, 검사특성, 특성클래스, 검사기준)
         - 관련 스터디 진행
             . 시간 : 16:30 ~ 17:30 (1시간)
             . 참석 : 최문준 차장, 류상현 주임연구원
             . 내용 : 더마펌 프로젝트의 전반적인 구성 및 리뷰



MES구축Cell 일일보고(2022-02-11, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (50%)
         - 더마펌 MES 페이지에서 기준정보 관련 프로세스 분석
    [MES10 개발_더마펌 프로젝트 안정화]
    1) "모니터링 > 설비가동현황" 개발 안정화 (40%)
         - 현재 2월달 설비 가동률 데이터가 출력되지 않는 문제점 발생
         - 캘린더/작업조 편성 등 기준정보 설정이 되어있지 않아 
            데이터가 제대로 반영되지 않는 것으로 예상되며,
            해당 사항 확인중

            

MES구축Cell 일일보고(2022-02-14, 류상현)
    [MES10 개발]
    1) 스마트팩토리지원사업 프로그램 설계서 작성 (100%)
         - 대상 메뉴 : 생산계획대비실적현황 / 설비가동현황 (총 2건)
         - 대상 메뉴에 대한 화면설계서 / 프로그램설계서 / 데이터베이스설계서 작성
    2) 더마펌_프로세스 분석 (50%)
         - 더마펌 MES 페이지에서 기준정보 관련 프로세스 분석
    [MES10 개발_더마펌 프로젝트 안정화]
    1) "품질검사 > 검사현황조회" 출력물 추가 수정 요청 (90%)
         - 폰트/자간/표현형식 등에 대한 세부 조정
    2) "모니터링 > 설비가동현황" 개발 안정화 (40%)
         - 현재 2월달 설비 가동률 데이터가 출력되지 않는 문제점 발생
         - 캘린더/작업조 편성 등 기준정보 설정이 되어있지 않아 
           데이터가 제대로 반영되지 않는 것으로 예상되며, 해당 확인중



MES구축Cell 일일보고(2022-02-15, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (50%)
         - 더마펌 MES 페이지에서 기준정보 관련 프로세스 분석
    [MES10 개발_더마펌 프로젝트 안정화]
    1) "품질검사 > 검사현황조회" 출력물 추가 수정 요청 (100%)
         - 폰트/자간/표현형식 등에 대한 세부 조정
    2) "모니터링 > 설비가동현황" 개발 안정화 (80%)
         - 현재 2월달 설비 가동률 데이터가 출력되지 않는 문제점 발생
         - 캘린더/작업조 편성 등 기준정보 설정에 대한 Guide 작성 후 고객사 안내 예정
         - 비가동 로직 수정소요 발생하여 해당 확인중



MES구축Cell 일일보고(2022-02-16, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (70%)
         - 더마펌 MES 페이지에서 제조레시피 관련 프로세스 분석
    2) TIC 제안 내용 및 관련 메뉴 분석 (40%)
        - 작업지시변환, 확정 / 공정진척관리 / 생산성(가동률 현황) 메뉴 
    [MES10 개발_더마펌 프로젝트 안정화]
    1) "모니터링 > 설비가동현황" 개발 안정화 (80%)
         - 현재 2월달 설비 가동률 데이터가 출력되지 않는 문제점 발생
         - 캘린더/작업조 편성 등 기준정보 설정에 대한 Guide 작성 후 고객사 안내 예정
         - 비가동 로직 수정소요 발생하여 해당 확인중
    2) 칭량실적현황_출력물 양식 변경 (95%)
         - 누락되었던 문서 태그(사명/문서번호) 추가
         - 글꼴 및 그리드 양식을 ERP10 완제품 시험성적서와 동기화
         - 배포 및 테스트 진행 예정

         

MES구축Cell 일일보고(2022-02-17, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (70%)
         - 더마펌 MES 페이지에서 제조레시피 관련 프로세스 분석
    2) TIC 제안 내용 및 관련 메뉴 분석 (50%)
        - 작업지시변환, 확정 / 공정진척관리 / 생산성(가동률 현황) 메뉴 



MES구축Cell 일일보고(2022-02-18, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (90%)
         - 더마펌 MES 페이지에서 생산지시/작업지시/로트/공정경로 관련 프로세스 분석
    2) TIC 제안 내용 및 관련 메뉴 분석 (70%)
        - 작업지시변환, 확정 / 공정진척관리 / 생산성(가동률 현황) 메뉴 



MES구축Cell 일일보고(2022-02-18, 류상현)
    [MES10 개발]
    1) 더마펌_프로세스 분석 (95%)
         - 더마펌 MES 페이지에서 생산지시/작업지시/로트/공정경로 관련 프로세스 분석
    2) TIC 제안 내용 및 관련 메뉴 분석 (95%)
        - 작업지시변환, 확정 / 공정진척관리 / 생산성(가동률 현황) 메뉴 
2. 기타 내용
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 착수 (2022-02-22(화) 예정)
3. 진행중인 내용



MES구축Cell 일일보고(2022-02-23, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석
         - AXLE 라인 실사
             . 시간 : 14:00 ~ 15:00
             . 장소 : 치절라인, 래핑라인
             . 참석
                  티아이씨 김경미 책임매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원
         - ERP 시스템 분석 회의 
             . 시간 : 15:00 ~ 17:30
             . 장소 : 프로젝트 회의실
             . 참석 
                  티아이씨 이종훈 책임매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원



MES구축Cell 일일보고(2022-02-23, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석
         - 라인 및 설비 배치 작성
         - AXLE 라인 실사
             . 시간 : 14:00 ~ 15:00
             . 장소 : 치절라인, 래핑라인
             . 참석
                  티아이씨 김경미 책임매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원
         - ERP 시스템 분석 회의 
             . 시간 : 15:00 ~ 17:30
             . 장소 : 프로젝트 회의실
             . 참석 
                  티아이씨 이종훈 책임매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원



MES구축Cell 일일보고(2022-02-23, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석
         - 라인 및 설비 배치 작성
         - 열처리 라인 실사 및 인터뷰
             . 시간 : 11:00 ~ 12:00 / 14:00 ~ 15:00
             . 장소 : 프로젝트 회의실
             . 참석 
                  티아이씨 이종훈 책임매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원
         - 볼스크류 라인 실사 및 인터뷰
             . 시간 : 15:00 ~ 17:30
             . 장소 : 치절라인, 래핑라인
             . 참석
                  티아이씨 김주수 매니저
                  정진완 부장, 백우종 책임연구원, 류상현 주임연구원



MES구축Cell 일일보고(2022-03-07, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석 후속 조치
         - 설비 정보 취합 마무리 (레이아웃, 장비 리스트 작성)
           . 첨부파일 참조 부탁드립니다.
         - ERP10 개발 서버에 회사정보/기준정보 등록 관련 미팅
           . 시간 : 16:00 ~ 18:00
           . 장소 : 모짜르트 회의실
           . 참석
                최문준 차장, 백우종 책임연구원, 유호성 주임연구원, 류상현 주임연구원
           . 내용 : 개발 서버에 회사정보 및 기준정보 등록 방법 및 메뉴 소개

           
           
MES구축Cell 일일보고(2022-03-08, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석 후속 조치
         - 설비 정보 추가 수정 (장비 모델명 추가)
    2) MES 개발 서버에 기준정보 등록
         - 작업장/공정/작업장별공정/품목 및 BOM 등록
         - 진척도 : 연삭기라인(40%) / TM라인(30%)



MES구축Unit 일일보고(2022-03-10, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석 후속 조치
         - 설비 정보 추가 수정 (장비 모델명 추가)
    2) MES 개발 서버에 기준정보 등록
         - 작업장/공정/작업장별공정 (100%)
		 - 품목 및 BOM (60%)
           : AXLE / 열처리 / 볼스크류 / 연삭기 / TM
		 - 지역라인/설비 
		 - 공정라우팅 및 버전

		 

MES구축Unit 일일보고(2022-03-10, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) 프로젝트 분석 후속 조치
         - 설비 정보 추가 수정 (장비 모델명 추가)
    2) MES 개발 서버에 기준정보 등록
         - 작업장/공정/작업장별공정 (100%)
		 - 품목 및 BOM (60%)
           : AXLE / 열처리 / 볼스크류 / 연삭기 / TM
		 - 지역라인/설비 
		 - 공정라우팅 및 버전
    3) TIC_MES 구축 기준정보 관련 미팅
         - 시간 : 17:00 ~ 18:30
         - 장소 : 모짜르트 회의실
         - 참석 : 정진완 팀장, 류상현 주임연구원
         - MES 기준정보 구성 및 프로젝트 구축 방안 논의

         

MES구축Unit 일일보고(2022-03-14, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - 기준정보 정의 및 등록 (95%)
         - 생산/작업지시 관련 프로세스 구성
         - 기준정보 구성 관련 미팅
             . 시간 : 15:30 ~ 17:00
             . 장소 : 열정 회의실 (17F)
             . 참석 : 정진완 팀장, 유호성 주임연구원, 류상현 주임연구원
             . 내용 : MES10 기준정보 구성 및 생산지시 프로세스 관련 논의



MES구축Unit 일일보고(2022-03-15, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
        - 기준정보 정의 및 등록 (95%)
            .지역/작업장/공정/라인/설비/품목/BOM/공정경로/활동코드/비가동사유
            .입력된 기준정보 리스트업
        - 생산/작업지시 관련 프로세스 구성
            .WEB      : 생산지시등록/생산지시변환/공정진척 완료
            .현장화면 : 생산지시등록/생산지시변환 완료

            

MES구축Unit 일일보고(2022-03-16, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - 기준정보 정의 및 등록 (95%)
             .지역/작업장/공정/라인/설비/품목/BOM/공정경로/활동코드/비가동사유
             .입력된 기준정보 리스트업
         - 생산/작업지시 관련 프로세스 구성
             .WEB : 생산지시등록/생산지시변환/공정진척 완료
             .현장화면 : 생산지시등록/생산지시변환 완료
    2) TIC MES10 프로세스 구축 관련 논의
         - 시간 : 17:00 ~ 18:30
         - 장소 : 모짜르트 회의실
         - 참석 : 정진완 팀장, 백우종 책임연구원, 류상현 주임연구원
         - 내용 : As-Is 및 To-Be 분석
    3) MES10 SF UI 인수인계
         - 시간 : 11:00 ~ 17:00
         - 장소 : 모짜르트 회의실
         - 참석 : 정진완 팀장, 손민욱 연구원
                     , 백우종 책임연구원, 유호성 주임연구원, 류상현 주임연구원
         - 내용 : SF UI 메뉴 및 기능 인수인계



MES구축Unit 일일보고(2022-03-17, 류상현)
[MES10 개발_주식회사 티아이씨 MES 구축]
1) MES 개발 서버에 TIC 프로세스 구축
- 기준정보 정의 및 등록 (95%)

2) TIC MES10 프로세스 구축 관련 논의
- 시간 : 09:30 ~ 10:30
- 장소 : 모짜르트 회의실
- 참석 : 백우종 책임연구원, 류상현 주임연구원
- 내용 : 기준정보 및 생산지시 프로세스 논의



MES구축Unit 일일보고(2022-03-18, 류상현)
[MES10 개발_주식회사 티아이씨 MES 구축]
1) MES 개발 서버에 TIC 프로세스 구축
- 기준정보 정의 및 등록 (95%)
  . To-Be 프로세스 분석하여 개발 서버에 반영
  . 열처리, 볼스크류, TM라인 공정 재정의 및 등록



MES구축Unit 일일보고(2022-03-21, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - To-Be 프로세스 분석 및 기준정보 반영 (개발서버)
         - 생산/작업지시 관련 프로세스 구성
            .WEB/SF : 생산지시등록/생산지시변환/공정진척 완료
    2) TIC MES10 구축 관련 논의
         - 시간 : 13:00 ~ 16:00
         - 장소 : 17F 피카소 회의실
         - 참석 : 정진완 팀장, 백우종 책임연구원, 류상현 주임연구원
         - 내용 : TIC MES10 구축을 위한 To-Be 분석

         

MES구축Unit 일일보고(2022-03-22, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - [완료] To-Be 프로세스 분석 및 기준정보 반영 (개발서버)
         - [완료] 생산/작업지시 관련 프로세스 구성
                      . WEB/SF : 생산지시등록/생산지시변환/공정진척 완료
         - [진행중] To-Be Process에 대한 Gap 분석
         - [진행중] 사업비 산출을 위한 메뉴/기능 리스트업
    2) TIC MES10 구축 관련 논의
         - 시간 : 13:00 ~ 14:00 (1차), 14:30 ~ 16:00 (2차)
         - 장소 : 18F 바하 회의실 (1차), 17F 고흐 회의실 (2차)
         - 참석 : 정진완 팀장, 백우종 책임연구원, 류상현 주임연구원
         - 내용 : TIC MES10 구축을 위한 To-Be 분석

         

MES구축Unit 일일보고(2022-03-23, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - [완료] To-Be 프로세스 분석 및 기준정보 반영 (개발서버)
         - [완료] 생산/작업지시 관련 프로세스 구성
                      . WEB/SF : 생산지시등록/생산지시변환/공정진척 완료
         - [진행중] To-Be Process에 대한 Gap 분석
         - [진행중] 사업비 산출을 위한 메뉴/기능 리스트업
    2) TIC MES10 구축 관련 논의
        - 시간 : 17:00 ~ 17:30
        - 장소 : 사무실
        - 참석 : 정진완 팀장, 백우종 책임연구원, 류상현 주임연구원
        - 내용 : TIC MES10 구축을 위한 To-Be 분석



MES구축Unit 일일보고(2022-03-25, 류상현)
    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
        - 기준정보 정의 및 등록 (75%)
           . To-Be 프로세스 분석하여 개발 서버에 반영
              -> 외주 거래선 공정정보 / 검사특성 / 불량유형 조사 및 반영 예정


              
MES구축Unit 일일보고(2022-03-28, 류상현)
    [더마펌 MES10 고도화 프로젝트]
    1) "로트별공수조회" 메뉴 수정 (2022-03-28, 100%)
         - 조회쿼리 수정
    2) 메인화면 위젯 수정 (2022-03-29, 70%)
         - [완료] 위젯 메뉴에서 위젯 그리드 색상을 파스텔톤으로 변경
         - [완료] 좌측 네비게이션 바의 접기/펼치기 버튼 활성화시키기
         - 그리드 꾸미기

    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - 기준정보 정의 및 등록 (75%)
            . 고객사 담당자(이종훈 책임매니저)에 정보 요청
               > 검사 특성, 불량유형, 검사출력물 / 외주 거래선 공정 정보
            . To-Be 프로세스에 맞춰 설비정보 최신화



MES구축Unit 일일보고(2022-03-29, 류상현)
    [더마펌 MES10 고도화 프로젝트]
    1) 메인화면 위젯 수정 (2022-03-30, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리
            > 이벤트 발생 시점에 대한 문제가 발생하여 해결중

    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
        - 기준정보 정의 및 등록 (80%)
            . 검사 특성, 불량유형, 출력물에 대한 정보 수집 및 코드화
            . To-Be 프로세스에 맞춰 설비정보 최신화 (2022-03-30, 95%)

            

MES구축Unit 일일보고(2022-03-30, 류상현)
    [더마펌 MES10 고도화 프로젝트]
    1) 메인화면 위젯 수정 (2022-03-30, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리,
          테이블 Header 배경색상 변경
           > 이벤트 발생 시점에 대한 문제가 발생하여 해결중
        - 조회 쿼리 변경

    [MES10 개발_주식회사 티아이씨 MES 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
        - 기준정보 정의 및 등록 (90%)
           . 검사 특성, 불량유형, 출력물에 대한 정보 수집 및 코드화
              > 고객사로부터 데이터를 전달받지 못해, 보류중. 추후 재연락 예정
                 (현재 출력물 정보 기반 샘플 데이터 구성중)
           . [완료] To-Be 프로세스에 맞춰 설비정보 최신화



MES구축Unit 일일보고(2022-03-31, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-03-30, 95%)
         - 메인대시보드 조회 권한 수정
            > 플랫폼팀 문의 및 점검중
         - 현재 진행중인 작업 Row에 대한 강조처리
            > 플랫폼팀 문의 및 점검중
         - 조회 쿼리 변경
            > 쿼리 수정 완료, 조회 데이터 점검중

    [티아이씨 MES10 구축]
    1) MES 개발 서버에 TIC 프로세스 구축
         - 기준정보 정의 및 등록 (90%)
            . 검사 특성, 불량유형, 출력물에 대한 정보 수집 및 코드화
               > 고객사로부터 데이터를 전달받지 못해, 보류중. 추후 재연락 예정
                 (출력물 사진 및 As-Is 기반 샘플 데이터 구성중)
  
    [AT바이오 MES10 구축]
    1) To-Be Process 분석



MES구축Unit 일일보고(2022-04-01, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-03-30, 95%)
         - 메인대시보드 조회 권한 수정
            > 플랫폼팀 문의 및 점검중
         - 현재 진행중인 작업 Row에 대한 강조처리
            > 플랫폼팀 JIRA 요청하여 수정중

    [티아이씨 MES10 구축]
    1) MES 개발 서버에 TIC 프로세스 구축 (90%)
         - 기준정보 정의 및 등록 
            . 검사 특성, 불량유형, 출력물에 대한 정보 수집 및 코드화
               > 고객사로부터 데이터를 전달받지 못해, 보류중. 추후 재연락 예정
                 (출력물 사진 및 As-Is 기반 샘플 데이터 구성중)
    2) MES SF UI 수정사항 도출을 위한 모듈 정상화 (50%)
         - "실적조회(MEMCOM00300)" 진입시 오류
         - 디버깅 및 수정사항 도출 
  
    [AT바이오 MES10 구축]
    1) To-Be Process 분석



MES구축Unit 일일보고(2022-04-04, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (95%)
         - 현재 진행중인 작업 Row에 대한 강조처리
            > 플랫폼팀 JIRA 요청하여 수정중

    [티아이씨 MES10 구축]
    1) MES SF UI 수정사항 도출을 위한 모듈 정상화 (60%)
         - 디버깅 및 수정사항 도출 
  
    [AT바이오 MES10 구축]
    1) To-Be Process 분석



MES구축Unit 일일보고(2022-04-05, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정
         - 현재 진행중인 작업 Row에 대한 강조처리
            > 플랫폼팀 JIRA 요청하여 수정중

    [티아이씨 MES10 구축]
    1) MES SF UI 수정사항 도출을 위한 모듈 정상화 (60%)
         - 디버깅 및 수정사항 도출 
  
    [AT바이오 MES10 구축]
    1) To-Be Process 분석
    2) AT바이오 제 1공장 현장실사
         - 시간 : 15:00 ~ 17:30
         - 장소 : 1층 레토르트 생산동
         - 참석 : 백우종 책임연구원, 류상현 주임연구원, 이건희 연구원
         - 생산관리 담당자 업무협의 (레토르트)
         - 이슈 및 논의사항은 회의록 정리 후 WIKI 업데이트 예정

         

MES구축Unit 일일보고(2022-04-06, 류상현)
    [티아이씨 MES10 구축]
    1) MES SF UI 수정사항 도출을 위한 모듈 정상화 (60%)
        - 디버깅 및 수정사항 도출
           . 모듈 정상화 진행중
        - 실적조회 및 검사특성 프로세스 구현
           . 입력된 검사특성 데이터를 기반으로 공정검사 프로세스 구현 예정

    [AT바이오 MES10 구축]
    1) To-Be Process 분석 (80%)
        - 1공장 1층(레토르트 생산) 현장 실사 회의록 작성
        - 3월 5주차 회의록/레이아웃/To-Be 프로세스 자료 분석
        - 레이아웃 참고하여 1공장 2층(EP/2EP/ST/분말 생산) 공정 Review 예정
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리
           > 플랫폼팀 JIRA 요청하여 수정중



MES구축Unit 일일보고(2022-04-06, 류상현)
    [티아이씨 MES10 구축]
    1) MES SF UI 수정사항 도출을 위한 모듈 정상화 (60%)
        - 실적조회 및 검사특성 프로세스 구현
           . 입력된 검사특성 데이터를 기반으로 공정검사 프로세스 구현 예정
           . "SF UI > 실적조회 메뉴 > 공정검사 기능" 정상화 필요하여 진행중
    2) To-Be Process 분석 회의
        - 시간 : 2022-04-08 16:00~17:00
        - 장소 : 17F 모네 회의실
        - 참석 : 백우종 책임연구원, 류상현 주임연구원

    [AT바이오 MES10 구축]
    1) 1공장 2층(EP/2EP/ST/분말 생산) 공정 및 As-IS 리뷰
        - 시간 : 14:00 ~ 16:00
        - 장소 : 14F 락 회의실
        - 참석 : 백우종 책임연구원, 류상현 주임연구원
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리
           > 플랫폼팀 JIRA 요청하여 수정중



MES구축Unit 일일보고(2022-04-11, 류상현)
    [티아이씨 MES10 구축]
    1) MES SF UI 수정사항 도출을 위한 모듈 정상화 (100%)
        - 실적조회 및 검사특성 프로세스 구현
           . 공정검사 기능 정상화 완료, 등록된 검사 특성에 따른 공정 수행
    2) Fit/Gap 분석을 위한 SF UI 화면 분석 (20%)
        - 예상 개선점, UI 구성에 대한 산출물 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)



MES구축Unit 일일보고(2022-04-12, 류상현)
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 1공장 1층(레토르트 생산) To-Be Process 분석 및 현장화면 구상 
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리
           > 플랫폼팀 JIRA 요청하여 수정중

        

MES구축Unit 일일보고(2022-04-13, 류상현)
    [티아이씨 MES10 구축]
    1) Fit/Gap 분석을 위한 SF UI 화면 분석 (40%)
        - 예상 개선점, UI 구성에 대한 산출물 작성
    2) ERP팀의 As-Is Process 분석 산출물 요청에 따라, As-Is 분석 (10%)
        - As-Is MES에 대한 접근이 어려워, ERP팀을 통해 이종훈 책임매니저님께 방안 요청 
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 1공장 2층(EP, ST 생산) 담당자 현장 실사는 담당자 일정으로 인해 취소
        - 1공장 2층(EP, ST 생산) To-Be Process 현장화면 구상 
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 현재 진행중인 작업 Row에 대한 강조처리
           > 플랫폼팀 JIRA 요청하여 수정중



MES구축Unit 일일보고(2022-04-14, 류상현)
    [티아이씨 MES10 구축]
    1) Fit/Gap 분석을 위한 SF UI 화면 분석 (60%)
        - 예상 개선점, UI 구성 작성
        - AXLE/볼스크류/열처리 현장화면 To-Be안 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)



MES구축Unit 일일보고(2022-04-15, 류상현)
    [티아이씨 MES10 구축]
    1) To-Be Process Fit/Gap 분석 (70%)
        - 예상 개선점, UI 구성에 대한 산출물 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)



MES구축Unit 일일보고(2022-04-19, 류상현)
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 시간 : 11:00 ~ 12:30
        - 장소 : 2층 EP/2EP/ST/분말 생산동
        - 참석 : 백우종 책임연구원, 류상현 주임연구원, 이건희 연구원
        - 생산관리 담당자 업무협의 (EP/2EP/ST/분말)
        - 이슈 및 논의사항은 회의록 정리 후 WIKI 업데이트 예정
    2) To-Be Process 정리 및 산출물 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 5월 2일(월) 플랫폼Cell 배포 예정, 배포 후 이벤트 추가하여 수정 예정



MES구축Unit 일일보고(2022-04-19, 류상현)
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 시간 : 11:00 ~ 12:30
        - 장소 : 2층 EP/2EP/ST/분말 생산동
        - 참석 : 백우종 책임연구원, 류상현 주임연구원, 이건희 연구원
        - 생산관리 담당자 업무협의 (EP/2EP/ST/분말)
        - 이슈 및 논의사항은 회의록 정리 후 WIKI 업데이트 예정
    2) To-Be Process 정리 및 산출물 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 5월 2일(월) 플랫폼Cell 배포 예정, 배포 후 이벤트 추가하여 수정 예정

        

MES구축Unit 일일보고(2022-04-19, 류상현)
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 착수보고 진행 (14:00 ~ 15:00)
        - 현장화면 설계 및 관련 회의록 작성
        - 공수등록, 부자재 및 부자재 로스 관리 현장화면 관련 협의
    2) To-Be Process 정리 및 산출물 작성
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 5월 2일(월) 플랫폼Cell 배포 예정, 배포 후 이벤트 추가하여 수정 예정



MES구축Unit 일일보고(2022-04-21, 류상현)
    [AT바이오 MES10 구축]
    1) ERP에서 요청된 As-Is Process 정리 및 산출물 작성 (40%)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (플랫폼개발Cell 수정중, 95%)
        - 플랫폼Cell 배포 일정
          4월 21일(목) 개발서버
          4월 27일(수) 고객사 서버 배포 예정
        - 개발서버 배포 후 추가 개발 및 테스트 예정



MES구축Unit 일일보고(2022-04-25, 류상현)
    [주식회사 티아이씨 MES10 구축]
    1) ERP에서 요청된 As-Is Process 정리 및 산출물 작성 (100%)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-04-27, 95%)
        - 개발서버 배포 및 테스트 완료
          4월 27일(수) 고객사 서버 배포 예정
    2) 더마펌 사용자 매뉴얼 작성 (착수예정)



MES구축Unit 일일보고(2022-04-26, 류상현)
    [AT바이오 MES10 구축]
    1) AT바이오 제 1공장 방문
        - 공수관리/부자재 및 부자재로스 관리 현장화면 To-Be Process 분석		
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-04-27, 95%)
        - 개발서버 배포 및 테스트 완료
          4월 27일(수) 고객사 서버 배포 예정
    2) 더마펌 사용자 매뉴얼 작성 (10%)



MES구축Unit 일일보고(2022-04-27, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-04-28, 95%)
        - 4월 28일(목) 고객사 서버 반영 확인
    2) 더마펌 사용자 매뉴얼 작성 (2022-04-27, 100%)



MES구축Unit 일일보고(2022-04-28, 류상현)
    [더마펌 MES10 고도화]
    1) 메인화면 위젯 수정 (2022-04-28, 100%)
        - 4월 28일(목) 고객사 서버 반영 확인
    [주식회사 티아이씨 MES10 구축]
    1) 검사성적서의 검사항목 데이터 리스트업 (2022-04-29, 50%)
        - 고객사로부터 HT검사(열처리) 검사성적서를 전달받음
           : 해당 검사 항목을 기준정보로 리스트업 및 입력
        - HT검사(열처리) 검사성적서 내 경도분포표(그래프) 출력이 어려울 것으로 판단
           : 방안 모색중
    [기타]
    1) 오후 반차 (14:00 ~)



MES구축Unit 일일보고(2022-04-29, 류상현)
    [주식회사 티아이씨 MES10 구축]
    1) 검사성적서의 검사항목 데이터 리스트업 (2022-04-29, 70%)
        - AS-IS ERP/MES의 검사 관련 메뉴 분석 및 검사항목/불량유형 지표 도출
        - HT검사(열처리) 검사성적서 내 경도분포표(그래프) 출력이 어려울 것으로 판단
           : 방안 모색중

           

MES구축Unit 일일보고(2022-05-02, 류상현)
    [주식회사 티아이씨 MES10 구축]
    1) 검사성적서의 검사항목 데이터 리스트업 (2022-04-29, 70%)
        - AS-IS ERP/MES의 검사 관련 메뉴 분석 및 검사항목/불량유형 지표 도출
        - HT검사(열처리) 검사성적서 내 경도분포표(그래프) 출력이 어려울 것으로 판단
           : 방안 모색중
    2) To-Be 구축을 위한 프로세스 개선점 점검 (50%)
        - 메인패널, 작업실적등록, 공정진척 메뉴 디버깅 및 개선점 도출



MES구축Unit 일일보고(2022-05-02, 류상현)
    [주식회사 티아이씨 MES10 구축]
    1) 검사성적서의 검사항목 데이터 리스트업 (2022-04-29, 70%)
        - AS-IS ERP/MES의 검사 관련 메뉴 분석 및 검사항목/불량유형 지표 도출
        - HT검사(열처리) 검사성적서 내 경도분포표(그래프) 출력이 어려울 것으로 판단
           : 방안 모색중
    2) To-Be 구축을 위한 프로세스 개선점 점검 (50%)
        - 메인패널, 작업실적등록, 공정진척 메뉴 디버깅 및 개선점 도출



MES구축Unit 일일보고(2022-05-03, 류상현)
    [MES10_주식회사 에이티바이오]
    1) AT바이오 제 1공장 방문 (2022-05-03)
        - AT바이오 1공장 1층, 2공장 분석을 위한 내부/고객 회의
    2) 1공장 1층/2층 현장화면 실사 (2022-05-04, 60%)
        - 현장화면에 대한 Script 작성 및 개선점 도출



MES구축Unit 일일보고(2022-05-04, 류상현)
    [MES10_주식회사 에이티바이오]
    1) AT바이오 제 2공장 방문 (2022-05-04)
        - AT바이오 2공장 현장실사 및 고객 회의
    2) 1공장 1층/2층 현장화면 실사 (2022-05-04, 60%)
        - 1공장 2층(ST/EP/2EP 생산) 현장화면 및 Script 작성
        - 구축시 개선점 도출



MES구축Unit 일일보고(2022-05-10, 류상현)
    [MES10_주식회사 에이티바이오]
    1) 공정진척 메뉴 설계 (2022-05-12, 30%)
        - AT바이오 1공장 1층 (레토르트 생산)
    2) 1공장 1층/2층 현장화면 실사 (2022-05-12, 90%)
        - 1공장 2층(ST/EP/2EP 생산) 현장화면 및 Script 작성
        - 구축시 개선점 도출



MES구축Unit 일일보고(2022-05-11, 류상현)
    [MES10_주식회사 에이티바이오]
    1) 공정진척 메뉴 설계 (2022-05-12, 90%)
        - AT바이오 1공장 1층 (레토르트 생산)/1공장 2층(ST/EP/2EP 생산)
            : 현장화면 및 Script 작성
        - 구축시 개선점 도출
    [MES10_주식회사 티아이씨]
    1) 고객 Feedback에 따른 To-Be 메뉴 설계 검토 (2022-05-12, 30%)
        - 모든 사업장에서 중간실적등록 기능 사용
        - 로트 내 재공품 대한 공정진척 필요 (공정 분리)
            : 로트를 분리해야하는지, 수량만 별도로 처리해야하는지 논의 필요



MES구축Unit 일일보고(2022-05-12, 류상현)
    [MES10_주식회사 에이티바이오]
    1) 공정진척 메뉴 설계 (2022-05-12, 100%)
        - AT바이오 1공장 1층 (레토르트 생산)/1공장 2층(ST/EP/2EP 생산)
            : 현장화면 및 Script 작성
        - 구축시 개선점 도출
    [MES10_주식회사 티아이씨]
    1) 고객 Feedback에 따른 To-Be 메뉴 설계 검토 (2022-05-13, 50%)
        - 고객 피드백 및 내부 회의에 따라 설계 변경
        - AS-IS MES를 통해 "메인패널" 메뉴에 대한 상세 설계 진행
    2) 개발목록 작성



MES구축Unit 일일보고(2022-05-13, 류상현)
    [MES10_주식회사 티아이씨]
    1) 고객 Feedback에 따른 To-Be 메뉴 설계 검토 (2022-05-13, 90%)
        - 고객 피드백 및 내부 회의에 따라 설계 변경
        - [완료] AS-IS MES를 통해 "메인패널" 메뉴에 대한 상세 설계 진행
    2) 개발목록 작성 (2022-05-15 착수 예정)



MES구축Unit 일일보고(2022-05-16, 류상현)
    [MES10_주식회사 티아이씨]
    1) 개발목록 작성 (2022-05-17 착수 예정)
    2) 고객사 방문
        - 일자 : 05/16 ~ 05/17 (2일간)
        - To-Be Process에 대한 고객사 협의
    [MES10_주식회사 에이티바이오]
    1) 업무 관련 미팅
         - 일시 : 2022-05-16 15:00 ~ 18:00
         - 장소  : 바하/모짜르트 회의실
         - 참석 : 정진완 부장 ,백우종 책임연구원, 류상현 주임연구원, 이건희 연구원
         - TO-BE Process 관련 내부 협의
    [5월 신규입사자 업무/개발환경 구성]
    1) 업무/개발환경 구성
        - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)
        - 주요 일정 (5/16)
           OA기기 및 임시사원증 수령
           IP등록 및 방화벽 신청
           초기 설치 프로그램 전달 및 설치 가이드
           신규입사자 "ERRP10 개발관련 VPN 방화벽 정책 신청"		



MES구축Unit 일일보고(2022-05-17, 류상현)
    [MES10_주식회사 티아이씨]
    1) 개발목록 작성 (2022-05-19 착수 예정)
    2) To-Be Process에 대한 고객사 협의 (볼스크류 사업부)
        - 일자 : 05/16 ~ 05/17 (2일간)
        - 장소 : 주식회사 티아이씨 2F 생산관리팀 회의실
        - 참석 : 티아이씨 볼스크류 사업부 및 담당자
                   본사 ERP/MES 담당자
        - 주요 논의
            1) 공정진척 관련 논의
            2) 제품 개별정보 및 검사성적서 관련 논의
            3) 작업지시 확정 이후 및 공정진척 중 작업장 변경 기능 관련 논의
        - 주요 논의사항에 대해 고객/ERP팀과 논의중
    [5월 신규입사자 업무/개발환경 구성]
    1) 업무/개발환경 구성
        - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)

        

MES구축Unit 일일보고(2022-05-18, 류상현)
    [MES10_주식회사 티아이씨]
    1) 개발목록 작성 (2022-05-19 착수 예정)
    2) To-Be Process에 대한 고객사 협의 (연삭기 사업부)
        - 일자 : 2022-05-17 10:00 ~ 11:30
        - 장소 : 주식회사 티아이씨 2공장 2F 대회의실
        - 참석 : 티아이씨 볼스크류 사업부 및 담당자
                본사 ERP/MES 담당자
        - 주요 논의
            1) 공정진척 관련 논의 (병렬공정)
            2) 검사성적서 관련 논의
        - 주요 논의사항에 대해 고객/ERP팀과 논의중
    [5월 신규입사자 업무/개발환경 구성]
    1) 업무/개발환경 구성
        - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)

        
        
MES구축Unit 일일보고(2022-05-19, 류상현)
    [MES10_주식회사 티아이씨]
    1) 개발목록 작성 (2022-05-20, 10%)
    2) To-Be Process 및 산출물 수정 (2022-05-20, 50%)
    [5월 신규입사자 업무/개발환경 구성]
    1) 업무/개발환경 구성
        - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)
		- 주요 일정 (5/16)
           [완료] OA기기 수령
           [완료] IP등록 및 방화벽 신청
           [완료] 신규입사자 "ERRP10 개발관련 VPN 방화벽 정책 신청"
           [완료] 소프트웨어 라이선스 사용자 변경 상신
                  - 한컴오피스 2020
                  - Visual Studio 2019 Pro
           [완료] Git 계정 생성
           [진행중] 초기 설치 프로그램 전달 및 설치 가이드

           
           
MES구축Unit 일일보고(2022-05-20, 류상현)
    [MES10_주식회사 티아이씨]
        1) 개발목록 작성 (보류, 10%)
            - 2022-05-23(월) 고객사 방문 후 작성 예정
        2) To-Be Process 및 산출물 수정 (2022-05-20, 80%)
    [5월 신규입사자 업무/개발환경 구성]
        1) 업무/개발환경 구성
            - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)
	- 개발서버 계정 생성 (2022-05-20, 100%)
    [MES10_주식회사 티아이씨]
        1) 고객사 방문 및 협의 (2022-05-23(월), 1일간)
    [MES10_주식회사 에이티바이오]
        1) 고객사 방문 및 협의 (2022-05-24(화), 1일간)



MES구축Unit 일일보고(2022-05-20, 류상현)
    [MES10_주식회사 티아이씨]
        1) 고객사 방문 및 협의 (2022-05-23(월), 1일간)
            - 일시 : 2022-05-23(월) 14:00 ~ 16:00
            - 장소 : 티아이씨 1공장 2F 대회의실
            - 참석 : 티아이씨 차량사업부
                         당사 ERP/MES팀
            - 내용
                > 로트이동, 공정진척 관련 논의
                > 열처리 작업일지, 검사성적서 관련 논의
    [5월 신규입사자 업무/개발환경 구성]
        1) 업무/개발환경 구성 (100%)
            - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)
    [MES10_주식회사 에이티바이오]
        1) 고객사 방문 및 협의 (2022-05-24(화), 1일간)



MES구축Unit 일일보고(2022-05-23, 류상현)
    [MES10_주식회사 티아이씨]
        1) 고객사 방문 및 협의 (2022-05-23(월), 1일간)
            - 일시 : 2022-05-23(월) 14:00 ~ 16:00
            - 장소 : 티아이씨 1공장 2F 대회의실
            - 참석 : 티아이씨 차량사업부
                         당사 ERP/MES팀
            - 내용
                > 로트이동, 공정진척 관련 논의
                > 열처리 작업일지, 검사성적서 관련 논의
    [5월 신규입사자 업무/개발환경 구성]
        1) 업무/개발환경 구성 (100%)
            - 대상 : 5월 16일부 신규입사자 (황성노 선임연구원)
    [MES10_주식회사 에이티바이오]
        1) 고객사 방문 및 협의 (2022-05-24(화), 1일간)



MES구축Unit 일일보고(2022-05-24, 류상현)
    [MES10_주식회사 에이티바이오]
        1) 고객사 방문 및 협의 (2022-05-24(화), 1일간)
            - 일시 : 2022-05-24(화) 14:00 ~ 16:00
            - 장소 : 에이티바이오 1공장 1F 레토르트 생산
            - 참석 : 에이티바이오 / 백우종 책임연구원, 이건희 연구원, 류상현 주임연구원
            - 내용
                > 1층 To-Be Process에 대한 현장화면 설계 리뷰
    [MES10_주식회사 티아이씨]
        1) 고객사 방문에 따른 To-Be Process 재정립
        2) 개발목록 작성



MES구축Unit 일일보고(2022-05-25, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성 (2022-05-26, 50%)
        2) 개발서버에 회사/기본정보 등록 (2022-05-26, 50%)
	[MES10_주식회사 티아이씨]
        1) To-Be Process 재논의에 따른 후속 문의사항 리스트업



MES구축Unit 일일보고(2022-05-26, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성 (2022-05-26, 50%)
        2) 개발서버에 회사/기본정보 등록 (2022-05-26, 50%)
             - MEMWND(칭량) 현장화면 구동 가능 수준까지 등록 필요
    [MES10_주식회사 티아이씨]
        1) To-Be Process 재논의에 따른 후속 문의사항 리스트업 (2022-05-26, 100%)
             - As-Is MES와의 비교를 통한 1차 문의사항 리스트업 완료
        2) To-Be Process 변경에 따른 개발목록 재작성 (2022-05-27, 50%)



MES구축Unit 일일보고(2022-05-27, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성 (2022-05-26, 60%)
             - 기준정보 리스트 작성 완료
        2) 개발서버에 회사/기본정보 등록 (2022-05-26, 50%)
             - MEMWND(칭량) 현장화면 구동 가능 수준까지 등록 필요
    [MES10_주식회사 티아이씨]
        1) To-Be Process 변경에 따른 개발목록 재작성 (2022-05-27, 100%)



MES구축Unit 일일보고(2022-05-30, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성 (2022-05-26, 60%)
             - 기준정보 리스트 작성 완료
        2) 개발서버에 회사/기본정보 등록 (2022-05-30, 100%)
             - MEMWND(칭량) 현장화면 구동 가능 수준까지 등록 필요
    [MES10_주식회사 티아이씨]
        1) To-Be Process 변경에 따른 개발목록 재작성 (2022-05-30, 100%)



MES구축Unit 일일보고(2022-05-31, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성
        2) 고객사 방문 (2022-05-31)
             - To-Be Process 논의 및 설계된 메뉴 점검



MES구축Unit 일일보고(2022-06-02, 류상현)
    [MES10_주식회사 에이티바이오]
        1) To-Be Process 수정안 작성
        2) 고객사 방문 (2022-05-31)
             - To-Be Process 논의 및 설계된 메뉴 점검
        3) 개발환경 구성 (2022-06-03, 50%)
[MES10_주식회사 티아이씨]
        1) To-Be Process 관련 검토
             - DR Designer를 통한 차트 표현 가능 여부 확인
                : 해당 기능이 정상적으로 구동되지 않아, 플랫폼 팀 문의 예정
        2) 개발환경 구성 (2022-06-03, 50%)



MES구축Unit 일일보고(2022-06-07, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안 작성
             - To-Be Process 및 설계화면 검토
             - DR Designer 상 차트 출력 기능 점검 (플랫폼 Cell과 논의중)
    [MES10_주식회사 에이티바이오]
        2) 고객사 방문 예정 (2022-06-08)
             - To-Be Process 논의 및 설계화면 검토 예정



MES구축Unit 일일보고(2022-06-08, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [완료] 작업지시조회(MEMCOM00500)
             - [진행] 메인패널(MEMLOT00200)
    [MES10_주식회사 에이티바이오]
        2) 고객사 방문 예정 (2022-06-08)
             - To-Be Process 논의 및 설계화면 검토 예정



MES구축Unit 일일보고(2022-06-09, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널(MEMLOT00200) (2022-06-13, 30%)

             

MES구축Unit 일일보고(2022-06-10, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작 (2022-06-14)
    [MES10]
        1) MES10 교육진행(바하, 09:00 ~ 18:00)



MES구축Unit 일일보고(2022-06-14, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널(MEMLOT00200) (2022-06-15, 80%)
                : SFUI 설계 변경에 따른 수정 개발
             - [완료] 작업실적조회(MEMCOM00300)

             

MES구축Unit 일일보고(2022-06-15, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널(MEMLOT00200) (2022-06-16, 90%)
                : SFUI 설계 변경에 따른 수정 개발
                  설계 관련 논의가 필요하여, 보류. 
                  내부 회의를 통해 설계요소 결정 후 진행 (2022-06-16 예정)
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (2022-06-16, 50%)
             - [진행] 메인패널_팝업_작업완료(MEMLOT00120) (2022-06-16, 20%)
			 - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130)  (2022-06-17, 20%)



MES구축Unit 일일보고(2022-06-16, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [완료] 메인패널(MEMLOT00200) (100%)
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (50%)
                     : UI배치/조회기능 완료, 저장 로직 구성은 보류
             - [진행] 메인패널_팝업_작업완료(MEMLOT00120) (20%)
             - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130)  (30%)
                     : UI배치/조회기능 완료, 저장 로직 구성은 보류



MES구축Unit 일일보고(2022-06-17, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (2022-06-16, 60%)
             - [진행] 메인패널_팝업_작업완료(MEMLOT00120) (2022-06-16, 50%)
			 - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130)  (2022-06-17, 30%)



MES구축Unit 일일보고(2022-06-20, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (2022-06-16, 90%)



MES구축Unit 일일보고(2022-06-21, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (2022-06-16, 95%)
                      : 디버깅 및 테스트중
             - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130) (2022-06-24, 30%)

             

MES구축Unit 일일보고(2022-06-22, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (2022-06-16, 95%)
                      : 디버깅 및 테스트중
             - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130) (2022-06-24, 30%)
                      : 로직 분석중



MES구축Unit 일일보고(2022-06-23, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (95%)
                      : 디버깅 및 테스트중
             - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130) (50%)
             - [예정] 메인패널_팝업_작업자관리 


             
MES구축Unit 일일보고(2022-06-28, 류상현)
    [MES10_주식회사 티아이씨]
        1) To-Be Process 수정안에 따른 메뉴 개발
             - [진행] 메인패널_팝업_중간실적등록(MEMLOT00130) (60%)
             - [진행] 메인패널_팝업_작업자관리(MEMCOM00100) (30%) 



MES구축Unit 일일보고(2022-06-29, 류상현)
    [MES10_주식회사 티아이씨]
        1) 개발된 메뉴 점검에 따른 수정사항 반영
             - [진행] 메인패널(MEMLOT00200) (10%) 
             - [진행] 메인패널_팝업_작업자관리(MEMCOM00100) (30%) 
             - [진행] 메인패널(MEMLOT00200) (20%) 




MES구축Unit 일일보고(2022-06-30, 류상현)
    [MES10_주식회사 티아이씨]
        1) 개발된 메뉴 점검에 따른 수정사항 반영
             - [완료] 메인패널(MEMLOT00200) (100%) 
             - [진행] 메인패널_팝업_작업자관리(MEMCOM00100) (95%) 
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (95%) 



MES구축Unit 일일보고(2022-06-30, 류
    [MES10_주식회사 티아이씨]
        1) 개발된 메뉴 점검에 따른 수정사항 반영
             - [진행] 메인패널_팝업_작업자관리(MEMCOM00100) (95%) 
             - [진행] 메인패널_팝업_작업시작(MEMLOT00110) (