/*	하늘에서 초콜릿이 비처럼 내려와 I
[문제]
은지가 꿈을 꾸었는데, 하늘에서 초콜릿이 비처럼 내려왔다.
꿈 속의 공간에서 1초에 1칸씩 초콜릿이 떨어지며, 초콜릿은 각자 다른 당도를 가지고 있었다.
떨어지기 시작하는 위치 또한 제각각이었다.

은지는 빠르게 어디로든 이동하며 초콜릿을 먹을 수 있었다.

은지는 당도의 총합을 가장 높게 하여 먹는 것이 마음에 걸려, 당도의 총합을 두번째로 높게 먹으려 한다.
가장 높은 당도의 총합 및 두번쨰로 높은 당도의 총합을 구하시오.

(이동 거리에는 제한이 없고,
 0초 시점에서 맨 아래 행는 초콜릿이 없다.)

[입력]


[출력]


[입력 예시]
4
9 3 0 0
0 0 5 6
4 1 0 0
0 0 0 0
5
8 2 3 5 5
2 0 0 3 1
3 2 5 1 1
1 2 0 2 8
0 0 0 0 0 

[출력 예시]
#1 19 18
#2 24 23
 */
/*
어레이 리스트로 받아서 정렬 후 가장 작은 차이를 총합에서 마이너스
 */
package SWCert_ADV;

public class IM_EX181130_FallingChocolate_I {
	
}
