

192.168.100.0 /24

 60 Host,  30 Host X 2
 2 Host X 2


192.168.100.00 000000 -> 192.168.100.0
192.168.100.00 111111 -> 192.168.100.63
255.255.255.11 000000 -> 255.255.255.192 /26

192.168.100.01 0 00000 -> 192.168.100.64
192.168.100.01 0 11111 -> 192.168.100.95
255.255.255.11 1 00000 -> 255.255.255.224 /27

192.168.100.01 1 00000 -> 192.168.100.96
192.168.100.01 1 11111 -> 192.168.100.127
255.255.255.11 1 00000 -> 255.255.255.224 /27

192.168.100.10 0000 00 -> 192.168.100.128
192.168.100.10 0000 11 -> 192.168.100.131
255.255.255.11 1111 00 -> 255.255.255.252 /30

192.168.100.10 0001 00 -> 192.168.100.132
192.168.100.10 0001 11 -> 192.168.100.135
255.255.255.11 1111 00 -> 255.255.255.252 /30

192.168.100.11 000000
255.255.255.11 000000

!-Router0
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R0
R0(config)#interface fastethernet 0/0
R0(config-if)#ip address 192.168.100.62 255.255.255.192
R0(config-if)#no shutdown

R0(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

R0(config-if)#interface serial 0/0
R0(config-if)#ip address 192.168.100.129 255.255.255.252
R0(config-if)#encapsulation hdlc
R0(config-if)#clock rate 1000000
R0(config-if)#bandwidth 1000
R0(config-if)#no shutdown


!-Router1
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#interface fastethernet 0/0
R1(config-if)#ip address 192.168.100.94 255.255.255.224
R1(config-if)#no shutdown

R1(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

R1(config-if)#interface serial 0/0
R1(config-if)#ip address 192.168.100.130 255.255.255.252
R1(config-if)#encapsulation hdlc
R1(config-if)#clock rate 1000000
This command applies only to DCE interfaces
R1(config-if)#bandwidth 1000
R1(config-if)#no shutdown

R1(config-if)#
%LINK-5-CHANGED: Interface Serial0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up

R1(config-if)#interface serial 0/1
R1(config-if)#ip address 192.168.100.133 255.255.255.252
R1(config-if)#encapsulation hdlc
R1(config-if)#clock rate 1000000
This command applies only to DCE interfaces
R1(config-if)#bandwidth 1000
R1(config-if)#no shutdown


!-Router2
Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R2
R2(config)#interface fastethernet 0/0
R2(config-if)#ip address 192.168.100.126 255.255.255.224
R2(config-if)#no shutdown

R2(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

R2(config-if)#interface serial 0/1
R2(config-if)#ip address 192.168.100.134 255.255.255.252
R2(config-if)#encapsulation hdlc
R2(config-if)#clock rate 1000000
R2(config-if)#bandwidth 1000
R2(config-if)#no shutdown








